## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 24 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        NAME                                         |
|--------|-------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.url_shortener_api_error`                          |
|        | `aws_cloudwatch_log_metric_filter.url_shortener_api_suspicious`                     |
|        | `aws_cloudwatch_log_metric_filter.url_shortener_api_warning`                        |
|        | `aws_cloudwatch_metric_alarm.cloudfront_ddos`                                       |
|        | `aws_cloudwatch_metric_alarm.route53_ddos`                                          |
|        | `aws_cloudwatch_metric_alarm.url_shoretener_api_suspicious`                         |
|        | `aws_cloudwatch_metric_alarm.url_shoretener_api_warning`                            |
|        | `aws_cloudwatch_metric_alarm.url_shortener_api_error`                               |
|        | `aws_cloudwatch_query_definition.api_errors`                                        |
|        | `aws_cloudwatch_query_definition.api_suspicious`                                    |
|        | `aws_cloudwatch_query_definition.api_warnings`                                      |
|        | `aws_shield_protection.cloudfront_api`                                              |
|        | `aws_shield_protection.route53_hosted_zone`                                         |
|        | `aws_sns_topic.cloudwatch_warning`                                                  |
|        | `aws_sns_topic.cloudwatch_warning_us_east`                                          |
|        | `aws_sns_topic_subscription.alert_warning`                                          |
|        | `aws_sns_topic_subscription.alert_warning_us_east`                                  |
|        | `module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda`       |
|        | `module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda`                 |
|        | `module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda`                   |
|        | `module.cloudwatch_alarms_slack.aws_iam_role_policy_attachment.notify_slack_lambda` |
|        | `module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack`                   |
|        | `module.cloudwatch_alarms_slack.aws_lambda_permission.notify_slack[0]`              |
|        | `module.cloudwatch_alarms_slack.aws_lambda_permission.notify_slack[1]`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.url_shortener_api_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "url_shortener_api_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/url-shortener-api"
      + name           = "ErrorLoggedAPI"
      + pattern        = "?ERROR ?Error ?error ?failed"

      + metric_transformation {
          + name      = "ErrorLoggedAPI"
          + namespace = "UrlShortener"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.url_shortener_api_suspicious will be created
  + resource "aws_cloudwatch_log_metric_filter" "url_shortener_api_suspicious" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/url-shortener-api"
      + name           = "Suspicious"
      + pattern        = "SUSPICIOUS"

      + metric_transformation {
          + name      = "Suspicious"
          + namespace = "UrlShortener"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.url_shortener_api_warning will be created
  + resource "aws_cloudwatch_log_metric_filter" "url_shortener_api_warning" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/url-shortener-api"
      + name           = "WarningLoggedAPI"
      + pattern        = "?WARNING ?Warning ?warning"

      + metric_transformation {
          + name      = "WarningLoggedAPI"
          + namespace = "UrlShortener"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.cloudfront_ddos will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DDoS detection for CloudFront"
      + alarm_name                            = "DDoS CloudFront"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:cloudfront::123456789012:distribution/A2Z6W4OZAEKEKP"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.route53_ddos will be created
  + resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DDoS detection for Route53"
      + alarm_name                            = "DDoS Route53"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:route53:::hostedzone/Z0129461HK2TKOF3BTTF"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.url_shoretener_api_suspicious will be created
  + resource "aws_cloudwatch_metric_alarm" "url_shoretener_api_suspicious" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Suspicious activity by users of the URL Shortener API lambda function over 5 minutes"
      + alarm_name                            = "URL Shortener API Suspicious"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Suspicious"
      + namespace                             = "UrlShortener"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.url_shoretener_api_warning will be created
  + resource "aws_cloudwatch_metric_alarm" "url_shoretener_api_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Warnings logged by the URL Shortener API lambda function"
      + alarm_name                            = "URL Shortener API Warnings"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WarningLoggedAPI"
      + namespace                             = "UrlShortener"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.url_shortener_api_error will be created
  + resource "aws_cloudwatch_metric_alarm" "url_shortener_api_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Errors logged by the URL Shortener API lambda function"
      + alarm_name                            = "URL Shortener API Errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ErrorLoggedAPI"
      + namespace                             = "UrlShortener"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.api_errors will be created
  + resource "aws_cloudwatch_query_definition" "api_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/url-shortener-api",
        ]
      + name                = "Errors API"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)ERROR|FAILED/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.api_suspicious will be created
  + resource "aws_cloudwatch_query_definition" "api_suspicious" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/url-shortener-api",
        ]
      + name                = "Suspicious activity API"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /SUSPICIOUS/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.api_warnings will be created
  + resource "aws_cloudwatch_query_definition" "api_warnings" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/url-shortener-api",
        ]
      + name                = "Warnings API"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /WARNING/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_shield_protection.cloudfront_api will be created
  + resource "aws_shield_protection" "cloudfront_api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "CloudFrontAPI"
      + resource_arn = "arn:aws:cloudfront::123456789012:distribution/A2Z6W4OZAEKEKP"
      + tags         = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # aws_shield_protection.route53_hosted_zone will be created
  + resource "aws_shield_protection" "route53_hosted_zone" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "Route53HostedZone"
      + resource_arn = "arn:aws:route53:::hostedzone/Z0129461HK2TKOF3BTTF"
      + tags         = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.cloudwatch_warning will be created
  + resource "aws_sns_topic" "cloudwatch_warning" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "cloudwatch-alarms-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.cloudwatch_warning_us_east will be created
  + resource "aws_sns_topic" "cloudwatch_warning_us_east" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "cloudwatch-alarms-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.alert_warning will be created
  + resource "aws_sns_topic_subscription" "alert_warning" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.alert_warning_us_east will be created
  + resource "aws_sns_topic_subscription" "alert_warning_us_east" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.cloudwatch_alarms_slack.data.aws_iam_policy_document.notify_slack_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "notify_slack_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda will be created
  + resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/url-shortener-cloudwatch-alarms-slack"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "url-shortener-production"
        }
      + tags_all          = {
          + "CostCentre" = "url-shortener-production"
        }
    }

  # module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda will be created
  + resource "aws_iam_policy" "notify_slack_lambda" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "NotifySlackLambda-url-shortener-cloudwatch-alarms-slack"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda will be created
  + resource "aws_iam_role" "notify_slack_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "NotifySlackLambda-url-shortener-cloudwatch-alarms-slack"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cloudwatch_alarms_slack.aws_iam_role_policy_attachment.notify_slack_lambda will be created
  + resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "NotifySlackLambda-url-shortener-cloudwatch-alarms-slack"
    }

  # module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack will be created
  + resource "aws_lambda_function" "notify_slack" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to post CloudWatch alarm notifications to a Slack channel."
      + filename                       = "/tmp/notify_slack.py.zip"
      + function_name                  = "url-shortener-cloudwatch-alarms-slack"
      + handler                        = "notify_slack.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "iC0Ta5b8fs9u6i/c3LA3/Tk8BUHfS6Jgq4NF8At0CBo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "url-shortener-production"
        }
      + tags_all                       = {
          + "CostCentre" = "url-shortener-production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_EVENTS"        = "True"
              + "PROJECT_NAME"      = "url-shortener"
              + "SLACK_WEBHOOK_URL" = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.cloudwatch_alarms_slack.aws_lambda_permission.notify_slack[0] will be created
  + resource "aws_lambda_permission" "notify_slack" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "url-shortener-cloudwatch-alarms-slack"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS-url-shortener-cloudwatch-alarms-slack-0"
      + statement_id_prefix = (known after apply)
    }

  # module.cloudwatch_alarms_slack.aws_lambda_permission.notify_slack[1] will be created
  + resource "aws_lambda_permission" "notify_slack" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "url-shortener-cloudwatch-alarms-slack"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS-url-shortener-cloudwatch-alarms-slack-1"
      + statement_id_prefix = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.url_shoretener_api_suspicious"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.url_shoretener_api_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.url_shortener_api_error"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.url_shortener_api_error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.url_shortener_api_warning"]

27 tests, 16 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
